### CREATE A DATAFRAME FROM LIST

In [1]:
student_data = [['nidhi', 27], ['shreesha', 20],['ankita', 26], ['divya', 25]]

In [2]:
student_data

[['nidhi', 27], ['shreesha', 20], ['ankita', 26], ['divya', 25]]

In [3]:
import pandas as pd

In [4]:
student_age_df = pd.DataFrame(student_data, columns=['Name','Age'])

In [5]:
student_age_df

       Name  Age
0     nidhi   27
1  shreesha   20
2    ankita   26
3     divya   25

In [6]:
def create_dataframe(data_list):
    output = pd.DataFrame(data_list, columns = ['col_1', 'col_2'])
    return output

In [7]:
create_dataframe(student_data)

      col_1  col_2
0     nidhi     27
1  shreesha     20
2    ankita     26
3     divya     25

In [8]:
def create_dataframe(data_list):
    col_names = ['col_1', 'col_2']
    output = pd.DataFrame(data_list, columns = col_names )
    return output

In [9]:
create_dataframe(student_data)

      col_1  col_2
0     nidhi     27
1  shreesha     20
2    ankita     26
3     divya     25

### Get size of the DataFrame

In [10]:
# size_df = student_age_df.count().to_list()

In [11]:
df_size = student_age_df.shape

In [12]:
list(df_size)

[4, 2]

In [13]:
size_df = [student_age_df.shape[0], student_age_df.shape[1]]

In [14]:
size_df

[4, 2]

### Display the First Three rows

In [15]:
student_age_df.head(3)

       Name  Age
0     nidhi   27
1  shreesha   20
2    ankita   26

### Select Data

loc and iloc methods

In [16]:
#select data with .loc
student_age_df.loc[student_age_df['Name']=='nidhi']

    Name  Age
0  nidhi   27

In [17]:
# select data with loc and specific columns
student_age_df.loc[student_age_df['Name']=='nidhi', ['Age']]

   Age
0   27

In [18]:
student_age_df.iloc[[0][0]]

Name    nidhi
Age        27
Name: 0, dtype: object

### Create a New column

In [19]:
student_age_df['last_name'] = ['g','f','c','d']

In [20]:
student_age_df

       Name  Age last_name
0     nidhi   27         g
1  shreesha   20         f
2    ankita   26         c
3     divya   25         d

In [21]:
doub_age = 2*student_age_df['Age']

In [22]:
doub_age

0    54
1    40
2    52
3    50
Name: Age, dtype: int64

In [23]:
student_age_df.insert(1, 'age_2', doub_age )

In [24]:
student_age_df

       Name  age_2  Age last_name
0     nidhi     54   27         g
1  shreesha     40   20         f
2    ankita     52   26         c
3     divya     50   25         d

In [26]:
# DataFrame.assign(**kwargs)
student_age_df.assign(age_0=[1,2,3,4])

       Name  age_2  Age last_name  age_0
0     nidhi     54   27         g      1
1  shreesha     40   20         f      2
2    ankita     52   26         c      3
3     divya     50   25         d      4

In [27]:
# DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)

In [28]:
type(student_age_df)

pandas.core.frame.DataFrame